       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN. 

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       LINKAGE SECTION.
       01  RC     PIC 9 COMP-5.
       01  RESULT PIC 9(4).

       PROCEDURE DIVISION USING BY REFERENCE COLUMN-ID.
      * Calculate sum of array elements
           DISPLAY "COLUMN-ID " COLUMN-ID
           ADD COLUMN-ID TO SUM-RESULT

           EXIT PROGRAM.
